<?php

use Zizaco\Confide\ConfideUser;
use Zizaco\Confide\ConfideUserInterface;

class User extends Eloquent implements ConfideUserInterface
{
  use ConfideUser;

    public function ban(){
        $status = $this->isBanned;
        if($status==0){
            $this->isBanned=1;
            $this->save();

        }
    }

    public function banWithExpireDate($timest){
        $status = $this->isBanned;
        if($status==0){
            $this->banExpirationDate = $timest;
            $this->isBanned=1;
            $this->save();

        }
    }

    public function unBan(){
        $status = $this->isBanned;
        if($status==1){
            $this->banExpirationDate=NULL;
            $this->isBanned=0;
            $this->save();
        }

    } 

    public static function checkUpdateBanStatus($user){
        if($user->isBanned==1){
            $today = date('Y-m-d H:i:s');
            if($today>=$user->banExpirationDate) {
                $user->unban();
            }
        }
        if($user->isBanned==0){
            $trans = Transaction::where('buyerId','=',$user->id)->where('status','=','payment_waiting')->orderBy('created_at', 'desc')->lists('created_at');
            $last2week = date('Y-m-d H:i:s',mktime(0, 0, 0, date("m"), date("d")-14, date("Y")));
            $last3month2week = date('Y-m-d H:i:s',mktime(0, 0, 0, date("m")-3, date("d")-14, date("Y")));
            foreach($trans as $tran){
                if($tran < $last2week && $tran > $last3month2week){
                    Auth::user()->banWithExpireDate(date('Y-m-d H:i:s',mktime(0, 0, 0, date("m",strtotime($tran))+3, date("d",strtotime($tran))+14, date("Y",strtotime($tran)))));
                    break;
                }
            }
        }

    }

    protected $fillable = array(
       'name', 'surname', 'address', 'country',
       'telephone', 'username', 'email', 'password',
       'confirmation_code', 'remember_token',
       'role', 'isBanned', 'banExpirationDate'
       );

    public function getFullName() {
        return $this->name.' '.$this->surname;
    }

    public function getId()
    {
        return $this->id;
    }

    public function isBuyer() {
        return $this->role == "Buyer";
    }

    public function isSeller() {
        return $this->role == "Seller";
    }

    static function countryList(){
       return array(
        '' => 'กรุณาเลือก',
        'AX' => 'หมู่เกาะเออแลนด์',
        'GR' => 'กรีซ',
        'GL' => 'กรีนแลนด์',
        'GU' => 'กวม',
        'GP' => 'กวาเดอลูป',
        'KH' => 'กัมพูชา',
        'GT' => 'กัวเตมาลา',
        'QA' => 'กาตาร์',
        'GH' => 'กานา',
        'GA' => 'กาบอง',
        'GY' => 'กายอานา',
        'GN' => 'กินี',
        'GW' => 'กินีบิสเซา',
        'GD' => 'เกรเนดา',
        'GG' => 'เกอร์นเซย์',
        'KR' => 'เกาหลี',
        'KP' => 'เกาหลีเหนือ',
        'BV' => 'เกาะบูเวต์',
        'IM' => 'เกาะแมน',
        'HM' => 'เกาะเฮิร์ตและหมู่เกาะแมกดอนัลด์',
        'GM' => 'แกมเบีย',
        'CG' => 'คองโก',
        'CD' => 'คองโก (DRC)',
        'KM' => 'คอโมโรส',
        'CR' => 'คอสตาริกา',
        'KZ' => 'คาซัคสถาน',
        'CV' => 'คาโบเวร์เดอ',
        'KI' => 'คิริบาส',
        'CU' => 'คิวบา',
        'KG' => 'คีร์กีซสถาน',
        'CW' => 'คูราเซา',
        'KW' => 'คูเวต',
        'KE' => 'เคนยา',
        'CA' => 'แคนาดา',
        'CM' => 'แคเมอรูน',
        'HR' => 'โครเอเชีย',
        'CO' => 'โคลัมเบีย',
        'GE' => 'จอร์เจีย',
        'JO' => 'จอร์แดน',
        'JM' => 'จาเมกา',
        'DJ' => 'จิบูตี',
        'CN' => 'จีน',
        'JE' => 'เจอร์ซี่',
        'SJ' => 'แจนมาเยิน',
        'TD' => 'ชาด',
        'CL' => 'ชิลี',
        'SM' => 'ซานมาริโน',
        'XS' => 'ซาบา',
        'WS' => 'ซามัว',
        'SA' => 'ซาอุดิอาราเบีย',
        'SX' => 'ซินท์มาร์เทิน',
        'XE' => 'ซินท์อุสตาทิอุส',
        'ZW' => 'ซิมบับเว',
        'SY' => 'ซีเรีย',
        'SD' => 'ซูดาน',
        'SR' => 'ซูรินาเม',
        'SC' => 'เซเชลส์',
        'KN' => 'เซนต์คิตส์และเนวิส',
        'BL' => 'เซนต์บาร์เธเลมี',
        'MF' => 'เซนต์มาร์ติน',
        'LC' => 'เซนต์ลูเซีย',
        'VC' => 'เซนต์วินเซนต์และเกรนาดีนส์',
        'SH' => 'เซนต์เฮเลนา แอสเซนชัน และทริสตันดาคูนา',
        'SN' => 'เซเนกัล',
        'RS' => 'เซอร์เบีย',
        'ST' => 'เซาโตเมและปรินซิเป',
        'SL' => 'เซียร์ราลีโอน',
        'PM' => 'แซงปีแยร์และมีเกอลง',
        'ZM' => 'แซมเบีย',
        'SO' => 'โซมาเลีย',
        'CY' => 'ไซปรัส',
        'JP' => 'ญี่ปุ่น',
        'DK' => 'เดนมาร์ก',
        'DM' => 'โดมินิกา',
        'TT' => 'ตรินิแดดและโตเบโก',
        'TO' => 'ตองกา',
        'TL' => 'ติมอร์-เลสเต',
        'TR' => 'ตุรกี',
        'TN' => 'ตูนิเซีย',
        'TV' => 'ตูวาลู',
        'TM' => 'เติร์กเมนิสถาน',
        'TK' => 'โตเกเลา',
        'TG' => 'โตโก',
        'TW' => 'ไต้หวัน',
        'TJ' => 'ทาจิกิสถาน',
        'TZ' => 'แทนซาเนีย',
        'TH' => 'ไทย',
        'NO' => 'นอร์เวย์',
        'NA' => 'นามิเบีย',
        'NR' => 'นาอูรู',
        'NI' => 'นิการากัว',
        'NC' => 'นิวแคลิโดเนีย',
        'NZ' => 'นิวซีแลนด์',
        'NU' => 'นีอูเอ',
        'NL' => 'เนเธอร์แลนด์',
        'NP' => 'เนปาล',
        'NG' => 'ไนจีเรีย',
        'NE' => 'ไนเจอร์',
        'BR' => 'บราซิล',
        'IO' => 'บริติชอินเดียนโอเชียนเทร์ริทอรี',
        'BN' => 'บรูไน',
        'BW' => 'บอตสวานา',
        'BA' => 'บอสเนียและเฮอร์เซโกวีนา',
        'BD' => 'บังกลาเทศ',
        'BG' => 'บัลแกเรีย',
        'BB' => 'บาร์เบโดส',
        'BH' => 'บาห์เรน',
        'BS' => 'บาฮามาส',
        'BI' => 'บุรุนดี',
        'BF' => 'บูร์กินาฟาโซ',
        'BJ' => 'เบนิน',
        'BE' => 'เบลเยียม',
        'BY' => 'เบลารุส',
        'BZ' => 'เบลีช',
        'BM' => 'เบอร์มิวดา',
        'BQ' => 'โบแนร์',
        'BO' => 'โบลิเวีย',
        'PK' => 'ปากีสถาน',
        'PA' => 'ปานามา',
        'PG' => 'ปาปัวนิวกีนี',
        'PY' => 'ปารากวัย',
        'PW' => 'ปาเลา',
        'PE' => 'เปรู',
        'PR' => 'เปอร์โตริโก',
        'PT' => 'โปรตุเกส',
        'PL' => 'โปแลนด์',
        'FR' => 'ฝรั่งเศส',
        'MM' => 'พม่า',
        'FI' => 'ฟินแลนด์',
        'PH' => 'ฟิลิปปินส์',
        'GF' => 'เฟรนช์กียานา',
        'TF' => 'เฟรนช์เซาเทิร์นและแอนตาร์กติกแลนด์',
        'PF' => 'เฟรนช์โปลินีเซีย',
        'BT' => 'ภูฏาน',
        'MN' => 'มองโกเลีย',
        'MS' => 'มอนต์เซอร์รัต',
        'ME' => 'มอนเตเนโกร',
        'MU' => 'มอริเชียส',
        'MR' => 'มอริเตเนีย',
        'MD' => 'มอลโดวา',
        'MT' => 'มอลตา',
        'MV' => 'มัลดีฟส์',
        'MO' => 'มาเก๊า SAR',
        'MG' => 'มาดากัสการ์',
        'YT' => 'มายอต',
        'MQ' => 'มาร์ตินีก',
        'MW' => 'มาลาวี',
        'ML' => 'มาลี',
        'MY' => 'มาเลเซีย',
        'MX' => 'เม็กซิโก',
        'MZ' => 'โมซัมบิก',
        'MC' => 'โมนาโก',
        'MA' => 'โมร็อกโก',
        'FM' => 'ไมโครนีเซีย',
        'GI' => 'ยิบรอลตาร์',
        'UG' => 'ยูกันดา',
        'UA' => 'ยูเครน',
        'YE' => 'เยเมน',
        'DE' => 'เยอรมนี',
        'RW' => 'รวันดา',
        'RU' => 'รัสเซีย',
        'RE' => 'เรอูเนียง',
        'RO' => 'โรมาเนีย',
        'LU' => 'ลักเซมเบิร์ก',
        'LV' => 'ลัตเวีย',
        'LA' => 'ลาว',
        'LI' => 'ลิกเตนสไตน์',
        'LT' => 'ลิทัวเนีย',
        'LY' => 'ลิเบีย',
        'LS' => 'เลโซโท',
        'LB' => 'เลบานอน',
        'LR' => 'ไลบีเรีย',
        'VU' => 'วานูอาตู',
        'WF' => 'วาลลิสและฟุตูนา',
        'VE' => 'เวเนซุเอลา',
        'VN' => 'เวียดนาม',
        'LK' => 'ศรีลังกา',
        'ES' => 'สเปน',
        'SK' => 'สโลวัก',
        'SI' => 'สโลวีเนีย',
        'SZ' => 'สวาซิแลนด์',
        'CH' => 'สวิตเซอร์แลนด์',
        'SE' => 'สวีเดน',
        'US' => 'สหรัฐอเมริกา',
        'AE' => 'สหรัฐอาหรับเอมิเรตส์',
        'UK' => 'สหราชอาณาจักร',
        'VA' => 'สันตะสำนัก (นครวาติกัน)',
        'CI' => 'สาธารณรัฐโกตดิวัวร์',
        'CZ' => 'สาธารณรัฐเช็ก',
        'DO' => 'สาธารณรัฐโดมินิกัน',
        'MK' => 'สาธารณรัฐมาซิโดเนีย (ยูโกสลาเวียเดิม)',
        'CF' => 'สาธารณรัฐแอฟริกากลาง',
        'SG' => 'สิงคโปร์',
        'CX' => 'หมู่เกาะคริสต์มาส',
        'CK' => 'หมู่เกาะคุก',
        'KY' => 'หมู่เกาะเคย์แมน',
        'CC' => 'หมู่เกาะโคคอส (คีลลิง)',
        'GS' => 'หมู่เกาะเซาท์จอร์เจียและเซาท์แซนด์วิช',
        'SB' => 'หมู่เกาะโซโลมอน',
        'TC' => 'หมู่เกาะเติกส์และเคคอส',
        'UM' => 'หมู่เกาะน้อยรอบนอกสหรัฐอเมริกา',
        'MP' => 'หมู่เกาะนอร์เทิร์นมาเรียนา',
        'NF' => 'หมู่เกาะนอร์ฟอล์ก',
        'PN' => 'หมู่เกาะพิตแคร์น',
        'FK' => 'หมู่เกาะฟอล์กแลนด์',
        'FJ' => 'หมู่เกาะฟิจิ',
        'FO' => 'หมู่เกาะแฟโร',
        'MH' => 'หมู่เกาะมาร์แชลล์',
        'VG' => 'หมู่เกาะเวอร์จิน (บริติช)',
        'VI' => 'หมู่เกาะเวอร์จิน (อเมริกา)',
        'PS' => 'องค์การบริหารปาเลสไตน์',
        'AS' => 'อเมริกันซามัว',
        'AU' => 'ออสเตรเลีย',
        'AT' => 'ออสเตรีย',
        'AD' => 'อันดอร์รา',
        'AF' => 'อัฟกานิสถาน',
        'AZ' => 'อาเซอร์ไบจาน',
        'AR' => 'อาร์เจนตินา',
        'AM' => 'อาร์เมเนีย',
        'AW' => 'อารูบา',
        'GQ' => 'อิเควทอเรียลกินี',
        'IT' => 'อิตาลี',
        'IN' => 'อินเดีย',
        'ID' => 'อินโดนีเซีย',
        'IQ' => 'อิรัก',
        'IL' => 'อิสราเอล',
        'IR' => 'อิหร่าน',
        'EG' => 'อียิปต์',
        'UZ' => 'อุซเบกิสถาน',
        'UY' => 'อุรุกวัย',
        'EC' => 'เอกวาดอร์',
        'ET' => 'เอธิโอเปีย',
        'ER' => 'เอริเทรีย',
        'SV' => 'เอลซัลวาดอร์',
        'EE' => 'เอสโตเนีย',
        'AI' => 'แองกวิลลา',
        'AO' => 'แองโกลา',
        'AQ' => 'แอนตาร์กติกา',
        'AG' => 'แอนติกาและบาร์บูดา',
        'ZA' => 'แอฟริกาใต้',
        'DZ' => 'แอลจีเรีย',
        'AL' => 'แอลเบเนีย',
        'OM' => 'โอมาน',
        'IS' => 'ไอซ์แลนด์',
        'IE' => 'ไอร์แลนด์',
        'HK' => 'ฮ่องกง SAR',
        'HN' => 'ฮอนดูรัส',
        'HU' => 'ฮังการี',
        'HT' => 'เฮติ');
    }
}